add mermaid support for docs
